%% 割线-渐近线误差验算

%% 实验一
    % 实验一——膨胀
    xn = 1:336;
    x0 = 144;
    sin_theta = (xn - x0)/100 ./ sqrt(0.95^2 + ((xn - x0)/100).^2 );
    xk = [1 70;217 289;267 321;210 303;236 318];
    % 实验一——非膨胀
    xn = 1:336;
    x0 = 144;
    sin_theta = (xn - x0)/100 ./ sqrt(0.95^2 + ((xn - x0)/100).^2 );
    xk = [2 48;15 71;258 323;215 273;228 302];

%% 实验二
    % 实验二——膨胀
    xn = 1:336;
    x0 = 144;
    sin_theta = (xn - x0)/100 ./ sqrt(0.95^2 + ((xn - x0)/100).^2 );
    xk = [245 320;218 281;1 70;200 259;194 244];

    % 实验二——非膨胀
    xn = 1:336;
    x0 = 144;
    sin_theta = (xn - x0)/100 ./ sqrt(0.95^2 + ((xn - x0)/100).^2 );
    xk = [246 309;271 319;1 52;222 272;53 13];

    %% 实验三
    % 实验三——膨胀
    xn = 1:336;
    x0 = 144;
    sin_theta = (xn - x0)/100 ./ sqrt(0.95^2 + ((xn - x0)/100).^2 );
    xk = [2 64;35 67;214 275;195 247;247 319];

    % 实验三——非膨胀
    xn = 1:336;
    x0 = 144;
    sin_theta = (xn - x0)/100 ./ sqrt(0.95^2 + ((xn - x0)/100).^2 );
    xk = [22 67;2 64;201 240;214 275;247 319];

%% 实验四
    % 实验四——膨胀
    xn = 1:336;
    x0 = 144;
    sin_theta = (xn - x0)/100 ./ sqrt(0.95^2 + ((xn - x0)/100).^2 );
    xk = [232 291;206 264;69 12;89 36;256 296];

    % 实验四——非膨胀
    xn = 1:336;
    x0 = 144;
    sin_theta = (xn - x0)/100 ./ sqrt(0.95^2 + ((xn - x0)/100).^2 );
    xk = [236 298;52 2;211 258;73 29;206 250];

%% 参数计算
    sin_theta_xk = abs(sin_theta(xk))
    sin_theta_xk_mean = mean(sin_theta_xk,2)
    mean_sin_theta_xk_mean = mean(sin_theta_xk_mean)
    e = abs(mean_sin_theta_xk_mean - 1)*100
    a = 1/mean_sin_theta_xk_mean

%% 修正εᵣ
    e1 = [2.2317 2.8699 3.8506 5.3239 2.1283 3.6504 4.0230 4.9696];
    b = [1.3214 1.4364 1.4117 1.3998 1.3278 1.2911 1.4014 1.4126];
    e2 = e1.*b.*b
    b_mean = mean(b)
    e3 = e1.*b_mean.*b_mean
    




    
   